:PROPERTIES:
:header-args:lisp: :package mlx-user :results verbatim :exports both :eval no-export :dir (expand-file-name "./../../")
:header-args:python: :results verbatim output :exports both :eval no-export :dir (expand-file-name "./../../")
:END:
#+title: MLX-CL/IO/NPY
#+subtitle: Support NPY file read and write
#+author: 凉凉
#+html_head: <!-- The documentation is generated on 11111000000/tao-theme-emacs (tao-yin) with org literal programming style.  -->
#+html_head: <!-- The Unifont is destributed on cdn.jsdelivr.net -->
#+html_head: <link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/@fontsource/unifont@5.2.5/index.min.css">
#+html_head: <style> body { font-size: 1.05em; background-color: #171717; color: #dadada } </style>
#+html_head: <style> pre, code { font-family: "Unifont", monospace; }</style>
#+html_head: <style> pre { background-color: #171717; } </style>
#+html_head: <style> a { display: inline-block; border: 1px solid; border-radius: 0px; border-color: #f6f6f6; text-decoration: none; color: #f6f6f6; padding: 1px; margin: 1px; } </style>
#+html_head: <style> a:hover { color: #0e0e0e; background-color: #c3c3c3 } </style>
#+html_head: <style> .title { padding-top: 100px; padding-bottom: 10px } </style>
* About
=MLX-CL/IO/NPY= add support for reading and writing =mlx-array= from and to NPY file
via [[https://github.com/marcoheisig/numpy-file-format][marcoheisig/numpy-file-format]].

* Usage
** Loading
#+begin_src lisp
  (ql:quickload :mlx-cl/io/npy)
#+end_src

** Reading NPY file
#+begin_src lisp
  (mlx-array "./res/dat/example.npy")
#+end_src

#+RESULTS:
: array([[1, 2, 3],
:        [4, 5, 6]], dtype=float32)

this is equal to calling:

#+begin_src lisp
  (load-from "./res/dat/example.npy" :npy)
#+end_src

** Writing NPY file
#+begin_src lisp
  (save (mlx-array #2A((1 2 3) (4 5 6))) :output "./res/tmp/example.npy")
#+end_src

#+RESULTS:
: ./res/tmp/example.npy

#+begin_src python
  import numpy as np
  print(np.load("./res/tmp/example.npy"))
#+end_src

#+RESULTS:
: [[1 2 3]
:  [4 5 6]]
